In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame(data=[['Akash','Data Scientist','Germany'],['Maria','Marketing Manager','UAE'],['Zaheer','Software Development Engineer','USA'],['Kiara','Entrepreneur','India']],columns=['Name','Profession','Country'],index=[101,102,103,104])
df

       Name                     Profession  Country
101   Akash                 Data Scientist  Germany
102   Maria              Marketing Manager      UAE
103  Zaheer  Software Development Engineer      USA
104   Kiara                   Entrepreneur    India

In [3]:
df.to_csv('example.csv')

In [4]:
df1=pd.read_csv('example.csv')

In [5]:
df1

   Unnamed: 0    Name                     Profession  Country
0         101   Akash                 Data Scientist  Germany
1         102   Maria              Marketing Manager      UAE
2         103  Zaheer  Software Development Engineer      USA
3         104   Kiara                   Entrepreneur    India

In [6]:
df

       Name                     Profession  Country
101   Akash                 Data Scientist  Germany
102   Maria              Marketing Manager      UAE
103  Zaheer  Software Development Engineer      USA
104   Kiara                   Entrepreneur    India